from rapidfuzz import fuzz

# Ручна перевірка схожості речень
# Ви також можете додавати більше речень для порівняння
sentence1 = input("Введіть перше речення: ")
sentence2 = input("Введіть друге речення: ")
#sentence3 = input("Введіть третє речення: ") і т.д.

# Обчислення схожості (від 0 до 100)
similarity = fuzz.ratio(sentence1, sentence2) #, sentence3
# До прикладу, однакове питання звучить по-різному в різних опитуваннях:
# Введіть перше речення: Ким ти себе перш за все вважаєш?
# Введіть друге речення: Ким ти себе вважаєш?
# Схожість між реченнями: 76.92%
# Отже ми можемо один з варіантів вписати у QUESTIONS, бо він вище за 52%

# Другий сценарій:
# Введіть перше речення: Запорукою успіху в житті є…?
# Введіть друге речення: Запорукою успіху в житті НЕ є…?
# Схожість між реченнями: 94.92%
# Це два різних питання, тому щоб вони не проходили як одне, ми записуємо
# їх у HIGH_PRIORITY_QUESTIONS, щоб вони не додали поріг у 95%

print(f"Схожість між реченнями: {similarity:.2f}%")
